In [1]:
import pandas as pd
import numpy as np

In [5]:
data = {'Hoten':['Delomartin','Jessica','Bartomelotti'],'Ly':[7,2,5],'Van':[100, 200, 150],'Toan':[4.2, 7.3, 6]}

In [9]:
df = pd.DataFrame(data)
df

          Hoten  Ly  Van  Toan
0    Delomartin   7  100   4.2
1       Jessica   2  200   7.3
2  Bartomelotti   5  150   6.0

In [15]:
dfnew = pd.melt(frame=df,id_vars='Hoten',var_name='Môn học',value_name='Điểm')
dfnew

          Hoten Môn học   Điểm
0    Delomartin      Ly    7.0
1       Jessica      Ly    2.0
2  Bartomelotti      Ly    5.0
3    Delomartin     Van  100.0
4       Jessica     Van  200.0
5  Bartomelotti     Van  150.0
6    Delomartin    Toan    4.2
7       Jessica    Toan    7.3
8  Bartomelotti    Toan    6.0

In [16]:
df_new = dfnew.pivot(index='Hoten',columns='Môn học',values='Điểm')
df_new

Môn học        Ly  Toan    Van
Hoten
Bartomelotti  5.0   6.0  150.0
Delomartin    7.0   4.2  100.0
Jessica       2.0   7.3  200.0